pw5/openfoam/case/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/initialConditions"

dimensions [ 0 1 -1 0 0 0 0 ];

internalField uniform $flowVelocity;

boundaryField
{
    inlet
    {
        type        fixedValue;
        value       $internalField;
    }

    outlet
    {
        type        inletOutlet;
        inletValue  uniform ( 0 0 0 );
        value       $internalField;
    }
    
    sym
    {
        type        symmetryPlane;
    }

    walls
    {
        type        slip;
    }
    
    model
    {
        type        noSlip;
    }
    
    "proc.*"
    {
        type        processor;
    }
}

// ************************************************************************* //
